# Gözlem Ve Değişken Seçimi
### Loc ve Iloc

In [6]:
import numpy as np
import pandas as pd
m=np.random.randint(1,30,size=(10,3))
df=pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0     7    12    17
1    20    22    15
2    13    26     4
3    12    29    14
4    12     5     9
5    19     2    20
6     8    24    10
7     1    27    27
8    25     1    14
9    14    29    21

In [8]:
df["var1"][1:4]

1    20
2    13
3    12
Name: var1, dtype: int32

In [ ]:
#Loc : tanımlandığı şekliyle seçim yapmak için kullanılır.

In [9]:
df.loc[0:3]

   var1  var2  var3
0     7    12    17
1    20    22    15
2    13    26     4
3    12    29    14

In [ ]:
#iloc: alışık olduğumuz indeksleme mantığıyla seçim yapar

In [10]:
df.iloc[0:3]

   var1  var2  var3
0     7    12    17
1    20    22    15
2    13    26     4

In [21]:
df.iloc[0:3]["var3"]

0    17
1    15
2     4
Name: var3, dtype: int32

In [19]:
df.loc[0:3,["var2","var1"]]

   var2  var1
0    12     7
1    22    20
2    26    13
3    29    12